zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MC_RGM.h
/*
** ###################################################################
**     Processors:          MCXE32BMLL_cm7_core0
**                          MCXE32BMLL_cm7_core1
**                          MCXE32BMPB_cm7_core0
**                          MCXE32BMPB_cm7_core1
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260625
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MC_RGM
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_MC_RGM.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for MC_RGM
 *
 * CMSIS Peripheral Access Layer for MC_RGM
 */

#if !defined(PERI_MC_RGM_H_)
#define PERI_MC_RGM_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE32BMLL_cm7_core0) || defined(CPU_MCXE32BMPB_cm7_core0))
#include "MCXE32B_cm7_core0_COMMON.h"
#elif (defined(CPU_MCXE32BMLL_cm7_core1) || defined(CPU_MCXE32BMPB_cm7_core1))
#include "MCXE32B_cm7_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- MC_RGM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MC_RGM_Peripheral_Access_Layer MC_RGM Peripheral Access Layer
 * @{
 */

/** MC_RGM - Register Layout Typedef */
typedef struct {
  __IO uint32_t DES;                               /**< Destructive Event Status Register, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint32_t FES;                               /**< Functional /External Reset Status Register, offset: 0x8 */
  __IO uint32_t FERD;                              /**< Functional Event Reset Disable Register, offset: 0xC */
  __IO uint32_t FBRE;                              /**< Functional Bidirectional Reset Enable Register, offset: 0x10 */
  __IO uint32_t FREC;                              /**< Functional Reset Escalation Counter Register, offset: 0x14 */
  __IO uint32_t FRET;                              /**< Functional Reset Escalation Threshold Register, offset: 0x18 */
  __IO uint32_t DRET;                              /**< Destructive Reset Escalation Threshold Register, offset: 0x1C */
  __IO uint32_t ERCTRL;                            /**< External Reset Control Register, offset: 0x20 */
  __IO uint32_t RDSS;                              /**< Reset During Standby Status Register, offset: 0x24 */
  __IO uint32_t FRENTC;                            /**< Functional Reset Entry Timeout Control Register, offset: 0x28 */
  __I  uint32_t LPDEBUG;                           /**< Low Power Debug Control Register, offset: 0x2C */
} MC_RGM_Type;

/* ----------------------------------------------------------------------------
   -- MC_RGM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MC_RGM_Register_Masks MC_RGM Register Masks
 * @{
 */

/*! @name DES - Destructive Event Status Register */
/*! @{ */

#define MC_RGM_DES_F_POR_MASK                    (0x1U)
#define MC_RGM_DES_F_POR_SHIFT                   (0U)
/*! F_POR - Flag for power-on reset
 *  0b0..No power-on event has occurred since the last clear.
 *  0b1..A power-on event has occurred.
 */
#define MC_RGM_DES_F_POR(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_F_POR_SHIFT)) & MC_RGM_DES_F_POR_MASK)

#define MC_RGM_DES_FCCU_FTR_MASK                 (0x8U)
#define MC_RGM_DES_FCCU_FTR_SHIFT                (3U)
/*! FCCU_FTR - Flag for 'Destructive' Reset FCCU_FTR
 *  0b0..'Destructive' reset event FCCU_FTR has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event FCCU_FTR has occurred.
 */
#define MC_RGM_DES_FCCU_FTR(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_FCCU_FTR_SHIFT)) & MC_RGM_DES_FCCU_FTR_MASK)

#define MC_RGM_DES_STCU_URF_MASK                 (0x10U)
#define MC_RGM_DES_STCU_URF_SHIFT                (4U)
/*! STCU_URF - Flag for 'Destructive' Reset STCU_URF
 *  0b0..'Destructive' reset event STCU_URF has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event STCU_URF has occurred.
 */
#define MC_RGM_DES_STCU_URF(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_STCU_URF_SHIFT)) & MC_RGM_DES_STCU_URF_MASK)

#define MC_RGM_DES_MC_RGM_FRE_MASK               (0x40U)
#define MC_RGM_DES_MC_RGM_FRE_SHIFT              (6U)
/*! MC_RGM_FRE - Flag for 'Destructive' Reset MC_RGM_FRE
 *  0b0..'Destructive' reset event MC_RGM_FRE has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event MC_RGM_FRE has occurred.
 */
#define MC_RGM_DES_MC_RGM_FRE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_MC_RGM_FRE_SHIFT)) & MC_RGM_DES_MC_RGM_FRE_MASK)

#define MC_RGM_DES_FXOSC_FAIL_MASK               (0x100U)
#define MC_RGM_DES_FXOSC_FAIL_SHIFT              (8U)
/*! FXOSC_FAIL - Flag for 'Destructive' Reset FXOSC_FAIL
 *  0b0..'Destructive' reset event FXOSC_FAIL has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event FXOSC_FAIL has occurred.
 */
#define MC_RGM_DES_FXOSC_FAIL(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_FXOSC_FAIL_SHIFT)) & MC_RGM_DES_FXOSC_FAIL_MASK)

#define MC_RGM_DES_PLL_LOL_MASK                  (0x200U)
#define MC_RGM_DES_PLL_LOL_SHIFT                 (9U)
/*! PLL_LOL - Flag for 'Destructive' Reset PLL_LOL
 *  0b0..'Destructive' reset event PLL_LOL has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event PLL_LOL has occurred.
 */
#define MC_RGM_DES_PLL_LOL(x)                    (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_PLL_LOL_SHIFT)) & MC_RGM_DES_PLL_LOL_MASK)

#define MC_RGM_DES_CORE_CLK_FAIL_MASK            (0x400U)
#define MC_RGM_DES_CORE_CLK_FAIL_SHIFT           (10U)
/*! CORE_CLK_FAIL - Flag for 'Destructive' Reset CORE_CLK_FAIL
 *  0b0..'Destructive' reset event CORE_CLK_FAIL has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event CORE_CLK_FAIL has occurred.
 */
#define MC_RGM_DES_CORE_CLK_FAIL(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_CORE_CLK_FAIL_SHIFT)) & MC_RGM_DES_CORE_CLK_FAIL_MASK)

#define MC_RGM_DES_AIPS_PLAT_CLK_FAIL_MASK       (0x1000U)
#define MC_RGM_DES_AIPS_PLAT_CLK_FAIL_SHIFT      (12U)
/*! AIPS_PLAT_CLK_FAIL - Flag for 'Destructive' Reset AIPS_PLAT_CLK_FAIL
 *  0b0..'Destructive' reset event AIPS_PLAT_CLK_FAIL has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event AIPS_PLAT_CLK_FAIL has occurred.
 */
#define MC_RGM_DES_AIPS_PLAT_CLK_FAIL(x)         (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_AIPS_PLAT_CLK_FAIL_SHIFT)) & MC_RGM_DES_AIPS_PLAT_CLK_FAIL_MASK)

#define MC_RGM_DES_HSE_CLK_FAIL_MASK             (0x4000U)
#define MC_RGM_DES_HSE_CLK_FAIL_SHIFT            (14U)
/*! HSE_CLK_FAIL - Flag for 'Destructive' Reset HSE_CLK_FAIL
 *  0b0..'Destructive' reset event HSE_CLK_FAIL has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event HSE_CLK_FAIL has occurred.
 */
#define MC_RGM_DES_HSE_CLK_FAIL(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_HSE_CLK_FAIL_SHIFT)) & MC_RGM_DES_HSE_CLK_FAIL_MASK)

#define MC_RGM_DES_SYS_DIV_FAIL_MASK             (0x8000U)
#define MC_RGM_DES_SYS_DIV_FAIL_SHIFT            (15U)
/*! SYS_DIV_FAIL - Flag for 'Destructive' Reset SYS_DIV_FAIL
 *  0b0..'Destructive' reset event SYS_DIV_FAIL has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event SYS_DIV_FAIL has occurred.
 */
#define MC_RGM_DES_SYS_DIV_FAIL(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_SYS_DIV_FAIL_SHIFT)) & MC_RGM_DES_SYS_DIV_FAIL_MASK)

#define MC_RGM_DES_HSE_TMPR_RST_MASK             (0x20000U)
#define MC_RGM_DES_HSE_TMPR_RST_SHIFT            (17U)
/*! HSE_TMPR_RST - Flag for 'Destructive' Reset HSE_TMPR_RST
 *  0b0..'Destructive' reset event HSE_TMPR_RST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event HSE_TMPR_RST has occurred.
 */
#define MC_RGM_DES_HSE_TMPR_RST(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_HSE_TMPR_RST_SHIFT)) & MC_RGM_DES_HSE_TMPR_RST_MASK)

