zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MC_RGM.h
#define MC_RGM_DES_HSE_SNVS_RST_MASK             (0x40000U)
#define MC_RGM_DES_HSE_SNVS_RST_SHIFT            (18U)
/*! HSE_SNVS_RST - Flag for 'Destructive' Reset HSE_SNVS_RST
 *  0b0..'Destructive' reset event HSE_SNVS_RST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event HSE_SNVS_RST has occurred.
 */
#define MC_RGM_DES_HSE_SNVS_RST(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_HSE_SNVS_RST_SHIFT)) & MC_RGM_DES_HSE_SNVS_RST_MASK)

#define MC_RGM_DES_SW_DEST_MASK                  (0x20000000U)
#define MC_RGM_DES_SW_DEST_SHIFT                 (29U)
/*! SW_DEST - Flag for 'Destructive' Reset SW_DEST
 *  0b0..'Destructive' reset event SW_DEST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event SW_DEST has occurred.
 */
#define MC_RGM_DES_SW_DEST(x)                    (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_SW_DEST_SHIFT)) & MC_RGM_DES_SW_DEST_MASK)

#define MC_RGM_DES_DEBUG_DEST_MASK               (0x40000000U)
#define MC_RGM_DES_DEBUG_DEST_SHIFT              (30U)
/*! DEBUG_DEST - Flag for 'Destructive' Reset DEBUG_DEST
 *  0b0..'Destructive' reset event DEBUG_DEST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Destructive' reset event DEBUG_DEST has occurred.
 */
#define MC_RGM_DES_DEBUG_DEST(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_DES_DEBUG_DEST_SHIFT)) & MC_RGM_DES_DEBUG_DEST_MASK)
/*! @} */

/*! @name FES - Functional /External Reset Status Register */
/*! @{ */

#define MC_RGM_FES_F_EXR_MASK                    (0x1U)
#define MC_RGM_FES_F_EXR_SHIFT                   (0U)
/*! F_EXR - Flag for External Reset
 *  0b0..No external reset event has occurred since either the last clear or the last power-on reset assertion.
 *  0b1..An external reset event has occurred.
 */
#define MC_RGM_FES_F_EXR(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_F_EXR_SHIFT)) & MC_RGM_FES_F_EXR_MASK)

#define MC_RGM_FES_FCCU_RST_MASK                 (0x8U)
#define MC_RGM_FES_FCCU_RST_SHIFT                (3U)
/*! FCCU_RST - Flag for 'Functional' Reset FCCU_RST
 *  0b0..'Functional' reset event FCCU_RST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event FCCU_RST has occurred.
 */
#define MC_RGM_FES_FCCU_RST(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_FCCU_RST_SHIFT)) & MC_RGM_FES_FCCU_RST_MASK)

#define MC_RGM_FES_ST_DONE_MASK                  (0x10U)
#define MC_RGM_FES_ST_DONE_SHIFT                 (4U)
/*! ST_DONE - Flag for 'Functional' Reset ST_DONE
 *  0b0..'Functional' reset event ST_DONE has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event ST_DONE has occurred.
 */
#define MC_RGM_FES_ST_DONE(x)                    (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_ST_DONE_SHIFT)) & MC_RGM_FES_ST_DONE_MASK)

#define MC_RGM_FES_SWT0_RST_MASK                 (0x40U)
#define MC_RGM_FES_SWT0_RST_SHIFT                (6U)
/*! SWT0_RST - Flag for 'Functional' Reset SWT0_RST
 *  0b0..'Functional' reset event SWT0_RST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event SWT0_RST has occurred.
 */
#define MC_RGM_FES_SWT0_RST(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_SWT0_RST_SHIFT)) & MC_RGM_FES_SWT0_RST_MASK)

#define MC_RGM_FES_SWT1_RST_MASK                 (0x80U)
#define MC_RGM_FES_SWT1_RST_SHIFT                (7U)
/*! SWT1_RST - Flag for 'Functional' Reset SWT1_RST
 *  0b0..'Functional' reset event SWT1_RST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event SWT1_RST has occurred.
 */
#define MC_RGM_FES_SWT1_RST(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_SWT1_RST_SHIFT)) & MC_RGM_FES_SWT1_RST_MASK)

#define MC_RGM_FES_JTAG_RST_MASK                 (0x200U)
#define MC_RGM_FES_JTAG_RST_SHIFT                (9U)
/*! JTAG_RST - Flag for 'Functional' Reset JTAG_RST
 *  0b0..'Functional' reset event JTAG_RST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event JTAG_RST has occurred.
 */
#define MC_RGM_FES_JTAG_RST(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_JTAG_RST_SHIFT)) & MC_RGM_FES_JTAG_RST_MASK)

#define MC_RGM_FES_HSE_SWT_RST_MASK              (0x10000U)
#define MC_RGM_FES_HSE_SWT_RST_SHIFT             (16U)
/*! HSE_SWT_RST - Flag for 'Functional' Reset HSE_SWT_RST
 *  0b0..'Functional' reset event HSE_SWT_RST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event HSE_SWT_RST has occurred.
 */
#define MC_RGM_FES_HSE_SWT_RST(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_HSE_SWT_RST_SHIFT)) & MC_RGM_FES_HSE_SWT_RST_MASK)

#define MC_RGM_FES_HSE_BOOT_RST_MASK             (0x100000U)
#define MC_RGM_FES_HSE_BOOT_RST_SHIFT            (20U)
/*! HSE_BOOT_RST - Flag for 'Functional' Reset HSE_BOOT_RST
 *  0b0..'Functional' reset event HSE_BOOT_RST has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event HSE_BOOT_RST has occurred.
 */
#define MC_RGM_FES_HSE_BOOT_RST(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_HSE_BOOT_RST_SHIFT)) & MC_RGM_FES_HSE_BOOT_RST_MASK)

#define MC_RGM_FES_SW_FUNC_MASK                  (0x20000000U)
#define MC_RGM_FES_SW_FUNC_SHIFT                 (29U)
/*! SW_FUNC - Flag for 'Functional' Reset SW_FUNC
 *  0b0..'Functional' reset event SW_FUNC has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event SW_FUNC has occurred.
 */
#define MC_RGM_FES_SW_FUNC(x)                    (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_SW_FUNC_SHIFT)) & MC_RGM_FES_SW_FUNC_MASK)

#define MC_RGM_FES_DEBUG_FUNC_MASK               (0x40000000U)
#define MC_RGM_FES_DEBUG_FUNC_SHIFT              (30U)
/*! DEBUG_FUNC - Flag for 'Functional' Reset DEBUG_FUNC
 *  0b0..'Functional' reset event DEBUG_FUNC has not occurred since either the last clear or the last power-on reset assertion.
 *  0b1..'Functional' reset event DEBUG_FUNC has occurred.
 */
#define MC_RGM_FES_DEBUG_FUNC(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FES_DEBUG_FUNC_SHIFT)) & MC_RGM_FES_DEBUG_FUNC_MASK)
/*! @} */

/*! @name FERD - Functional Event Reset Disable Register */
/*! @{ */

