zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MC_RGM.h
#define MC_RGM_FERD_D_FCCU_RST_MASK              (0x8U)
#define MC_RGM_FERD_D_FCCU_RST_SHIFT             (3U)
/*! D_FCCU_RST - FCCU_RST Disable Control
 *  0b0..Functional reset event FCCU_RST triggers a reset sequence.
 *  0b1..Functional reset event FCCU_RST generates an interrupt request.
 */
#define MC_RGM_FERD_D_FCCU_RST(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FERD_D_FCCU_RST_SHIFT)) & MC_RGM_FERD_D_FCCU_RST_MASK)

#define MC_RGM_FERD_D_SWT0_RST_MASK              (0x40U)
#define MC_RGM_FERD_D_SWT0_RST_SHIFT             (6U)
/*! D_SWT0_RST - SWT0_RST Disable Control
 *  0b0..Functional reset event SWT0_RST triggers a reset sequence.
 *  0b1..Functional reset event SWT0_RST generates an interrupt request.
 */
#define MC_RGM_FERD_D_SWT0_RST(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FERD_D_SWT0_RST_SHIFT)) & MC_RGM_FERD_D_SWT0_RST_MASK)

#define MC_RGM_FERD_D_SWT1_RST_MASK              (0x80U)
#define MC_RGM_FERD_D_SWT1_RST_SHIFT             (7U)
/*! D_SWT1_RST - SWT1_RST Disable Control
 *  0b0..Functional reset event SWT1_RST triggers a reset sequence.
 *  0b1..Functional reset event SWT1_RST generates an interrupt request.
 */
#define MC_RGM_FERD_D_SWT1_RST(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FERD_D_SWT1_RST_SHIFT)) & MC_RGM_FERD_D_SWT1_RST_MASK)

#define MC_RGM_FERD_D_JTAG_RST_MASK              (0x200U)
#define MC_RGM_FERD_D_JTAG_RST_SHIFT             (9U)
/*! D_JTAG_RST - JTAG_RST Disable Control
 *  0b0..Functional reset event JTAG_RST triggers a reset sequence.
 *  0b1..Functional reset event JTAG_RST generates an interrupt request.
 */
#define MC_RGM_FERD_D_JTAG_RST(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FERD_D_JTAG_RST_SHIFT)) & MC_RGM_FERD_D_JTAG_RST_MASK)

#define MC_RGM_FERD_D_DEBUG_FUNC_MASK            (0x40000000U)
#define MC_RGM_FERD_D_DEBUG_FUNC_SHIFT           (30U)
/*! D_DEBUG_FUNC - DEBUG_FUNC Disable Control
 *  0b0..Functional reset event DEBUG_FUNC triggers a reset sequence.
 *  0b1..Functional reset event DEBUG_FUNC generates an interrupt request.
 */
#define MC_RGM_FERD_D_DEBUG_FUNC(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_FERD_D_DEBUG_FUNC_SHIFT)) & MC_RGM_FERD_D_DEBUG_FUNC_MASK)
/*! @} */

/*! @name FBRE - Functional Bidirectional Reset Enable Register */
/*! @{ */

#define MC_RGM_FBRE_BE_FCCU_RST_MASK             (0x8U)
#define MC_RGM_FBRE_BE_FCCU_RST_SHIFT            (3U)
/*! BE_FCCU_RST - Bidirectional Reset Enables for 'Functional' Reset FCCU_RST
 *  0b0..External reset pin is asserted on a 'Functional' reset FCCU_RST event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset FCCU_RST event.
 */
#define MC_RGM_FBRE_BE_FCCU_RST(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_FCCU_RST_SHIFT)) & MC_RGM_FBRE_BE_FCCU_RST_MASK)

#define MC_RGM_FBRE_BE_ST_DONE_MASK              (0x10U)
#define MC_RGM_FBRE_BE_ST_DONE_SHIFT             (4U)
/*! BE_ST_DONE - Bidirectional Reset Enables for 'Functional' Reset ST_DONE
 *  0b0..External reset pin is asserted on a 'Functional' reset ST_DONE event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset ST_DONE event.
 */
#define MC_RGM_FBRE_BE_ST_DONE(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_ST_DONE_SHIFT)) & MC_RGM_FBRE_BE_ST_DONE_MASK)

#define MC_RGM_FBRE_BE_SWT0_RST_MASK             (0x40U)
#define MC_RGM_FBRE_BE_SWT0_RST_SHIFT            (6U)
/*! BE_SWT0_RST - Bidirectional Reset Enables for 'Functional' Reset SWT0_RST
 *  0b0..External reset pin is asserted on a 'Functional' reset SWT0_RST event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset SWT0_RST event.
 */
#define MC_RGM_FBRE_BE_SWT0_RST(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_SWT0_RST_SHIFT)) & MC_RGM_FBRE_BE_SWT0_RST_MASK)

#define MC_RGM_FBRE_BE_SWT1_RST_MASK             (0x80U)
#define MC_RGM_FBRE_BE_SWT1_RST_SHIFT            (7U)
/*! BE_SWT1_RST - Bidirectional Reset Enables for 'Functional' Reset SWT1_RST
 *  0b0..External reset pin is asserted on a 'Functional' reset SWT1_RST event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset SWT1_RST event.
 */
#define MC_RGM_FBRE_BE_SWT1_RST(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_SWT1_RST_SHIFT)) & MC_RGM_FBRE_BE_SWT1_RST_MASK)

#define MC_RGM_FBRE_BE_JTAG_RST_MASK             (0x200U)
#define MC_RGM_FBRE_BE_JTAG_RST_SHIFT            (9U)
/*! BE_JTAG_RST - Bidirectional Reset Enables for 'Functional' Reset JTAG_RST
 *  0b0..External reset pin is asserted on a 'Functional' reset JTAG_RST event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset JTAG_RST event.
 */
#define MC_RGM_FBRE_BE_JTAG_RST(x)               (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_JTAG_RST_SHIFT)) & MC_RGM_FBRE_BE_JTAG_RST_MASK)

#define MC_RGM_FBRE_BE_HSE_SWT_RST_MASK          (0x10000U)
#define MC_RGM_FBRE_BE_HSE_SWT_RST_SHIFT         (16U)
/*! BE_HSE_SWT_RST - Bidirectional Reset Enables for 'Functional' Reset HSE_SWT_RST
 *  0b0..External reset pin is asserted on a 'Functional' reset HSE_SWT_RST event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset HSE_SWT_RST event.
 */
#define MC_RGM_FBRE_BE_HSE_SWT_RST(x)            (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_HSE_SWT_RST_SHIFT)) & MC_RGM_FBRE_BE_HSE_SWT_RST_MASK)

#define MC_RGM_FBRE_BE_HSE_BOOT_RST_MASK         (0x100000U)
#define MC_RGM_FBRE_BE_HSE_BOOT_RST_SHIFT        (20U)
/*! BE_HSE_BOOT_RST - Bidirectional Reset Enables for 'Functional' Reset HSE_BOOT_RST
 *  0b0..External reset pin is asserted on a 'Functional' reset HSE_BOOT_RST event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset HSE_BOOT_RST event.
 */
#define MC_RGM_FBRE_BE_HSE_BOOT_RST(x)           (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_HSE_BOOT_RST_SHIFT)) & MC_RGM_FBRE_BE_HSE_BOOT_RST_MASK)

#define MC_RGM_FBRE_BE_SW_FUNC_MASK              (0x20000000U)
#define MC_RGM_FBRE_BE_SW_FUNC_SHIFT             (29U)
/*! BE_SW_FUNC - Bidirectional Reset Enables for 'Functional' Reset SW_FUNC
 *  0b0..External reset pin is asserted on a 'Functional' reset SW_FUNC event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset SW_FUNC event.
 */
#define MC_RGM_FBRE_BE_SW_FUNC(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_SW_FUNC_SHIFT)) & MC_RGM_FBRE_BE_SW_FUNC_MASK)

#define MC_RGM_FBRE_BE_DEBUG_FUNC_MASK           (0x40000000U)
#define MC_RGM_FBRE_BE_DEBUG_FUNC_SHIFT          (30U)
/*! BE_DEBUG_FUNC - Bidirectional Reset Enables for 'Functional' Reset DEBUG_FUNC
 *  0b0..External reset pin is asserted on a 'Functional' reset DEBUG_FUNC event if the reset is enabled.
 *  0b1..External reset pin is not asserted on a 'functional' reset DEBUG_FUNC event.
 */
#define MC_RGM_FBRE_BE_DEBUG_FUNC(x)             (((uint32_t)(((uint32_t)(x)) << MC_RGM_FBRE_BE_DEBUG_FUNC_SHIFT)) & MC_RGM_FBRE_BE_DEBUG_FUNC_MASK)
/*! @} */

