zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_MC_RGM.h
/*! @name FREC - Functional Reset Escalation Counter Register */
/*! @{ */

#define MC_RGM_FREC_FREC_MASK                    (0xFU)
#define MC_RGM_FREC_FREC_SHIFT                   (0U)
/*! FREC - Functional' Reset Escalation Counter */
#define MC_RGM_FREC_FREC(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_FREC_FREC_SHIFT)) & MC_RGM_FREC_FREC_MASK)
/*! @} */

/*! @name FRET - Functional Reset Escalation Threshold Register */
/*! @{ */

#define MC_RGM_FRET_FRET_MASK                    (0xFU)
#define MC_RGM_FRET_FRET_SHIFT                   (0U)
/*! FRET - 'Functional' Reset Escalation Threshold */
#define MC_RGM_FRET_FRET(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_FRET_FRET_SHIFT)) & MC_RGM_FRET_FRET_MASK)
/*! @} */

/*! @name DRET - Destructive Reset Escalation Threshold Register */
/*! @{ */

#define MC_RGM_DRET_DRET_MASK                    (0xFU)
#define MC_RGM_DRET_DRET_SHIFT                   (0U)
/*! DRET - 'Destructive' Reset Escalation Threshold */
#define MC_RGM_DRET_DRET(x)                      (((uint32_t)(((uint32_t)(x)) << MC_RGM_DRET_DRET_SHIFT)) & MC_RGM_DRET_DRET_MASK)
/*! @} */

/*! @name ERCTRL - External Reset Control Register */
/*! @{ */

#define MC_RGM_ERCTRL_ERASSERT_MASK              (0x1U)
#define MC_RGM_ERCTRL_ERASSERT_SHIFT             (0U)
/*! ERASSERT - ERASSERT
 *  0b0..No change
 *  0b1..External reset is asserted
 */
#define MC_RGM_ERCTRL_ERASSERT(x)                (((uint32_t)(((uint32_t)(x)) << MC_RGM_ERCTRL_ERASSERT_SHIFT)) & MC_RGM_ERCTRL_ERASSERT_MASK)
/*! @} */

/*! @name RDSS - Reset During Standby Status Register */
/*! @{ */

#define MC_RGM_RDSS_DES_RES_MASK                 (0x1U)
#define MC_RGM_RDSS_DES_RES_SHIFT                (0U)
/*! DES_RES - DES_RES
 *  0b0..No destructive reset event occurred during standby mode.
 *  0b1..Destructive reset event occurred during standby mode.
 */
#define MC_RGM_RDSS_DES_RES(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_RDSS_DES_RES_SHIFT)) & MC_RGM_RDSS_DES_RES_MASK)

#define MC_RGM_RDSS_FES_RES_MASK                 (0x2U)
#define MC_RGM_RDSS_FES_RES_SHIFT                (1U)
/*! FES_RES - FES_RES
 *  0b0..No functional reset event occurred during standby mode.
 *  0b1..Functional reset event occurred during standby mode.
 */
#define MC_RGM_RDSS_FES_RES(x)                   (((uint32_t)(((uint32_t)(x)) << MC_RGM_RDSS_FES_RES_SHIFT)) & MC_RGM_RDSS_FES_RES_MASK)
/*! @} */

/*! @name FRENTC - Functional Reset Entry Timeout Control Register */
/*! @{ */

#define MC_RGM_FRENTC_FRET_EN_MASK               (0x1U)
#define MC_RGM_FRENTC_FRET_EN_SHIFT              (0U)
/*! FRET_EN - Functional Reset Entry Timer Enable/Disable
 *  0b0..Functional reset entry timer is disabled.
 *  0b1..Functional reset entry timer is enabled
 */
#define MC_RGM_FRENTC_FRET_EN(x)                 (((uint32_t)(((uint32_t)(x)) << MC_RGM_FRENTC_FRET_EN_SHIFT)) & MC_RGM_FRENTC_FRET_EN_MASK)

#define MC_RGM_FRENTC_FRET_TIMEOUT_MASK          (0xFFFFFFFEU)
#define MC_RGM_FRENTC_FRET_TIMEOUT_SHIFT         (1U)
/*! FRET_TIMEOUT - Functional Reset Entry Timer Value */
#define MC_RGM_FRENTC_FRET_TIMEOUT(x)            (((uint32_t)(((uint32_t)(x)) << MC_RGM_FRENTC_FRET_TIMEOUT_SHIFT)) & MC_RGM_FRENTC_FRET_TIMEOUT_MASK)
/*! @} */

/*! @name LPDEBUG - Low Power Debug Control Register */
/*! @{ */

#define MC_RGM_LPDEBUG_LP_DBG_EN_MASK            (0x1U)
#define MC_RGM_LPDEBUG_LP_DBG_EN_SHIFT           (0U)
/*! LP_DBG_EN - Low-Power Debug Enable/Disable Control
 *  0b0..Low-power debug disabled
 *  0b1..Debug data collection enabled before entering low-power debug
 */
#define MC_RGM_LPDEBUG_LP_DBG_EN(x)              (((uint32_t)(((uint32_t)(x)) << MC_RGM_LPDEBUG_LP_DBG_EN_SHIFT)) & MC_RGM_LPDEBUG_LP_DBG_EN_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group MC_RGM_Register_Masks */


/*!
 * @}
 */ /* end of group MC_RGM_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_MC_RGM_H_ */

